* McDowell (2020) 14CB
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_15cb
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2015
Data year(s)                          | August 2016
Longitude [°E]                        | -49.569493
Latitude [°N]                         | 67.18201297
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 675
Ice thickness year                    | 2015
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 370
Depth of bottom measurement [m]       | 670
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|      -10.4963041826 | 370.0 |
|      -10.2596179222 | 390.0 |
|       -9.6479316618 | 410.0 |
|       -9.0987454014 | 430.0 |
|        -8.674559141 | 450.0 |
|       -7.8753728806 | 470.0 |
|       -7.1386866202 | 490.0 |
|  -6.402000359800001 | 510.0 |
|  -5.665314099400001 | 530.0 |
|       -5.2969709692 | 540.0 |
|        -4.928627839 | 550.0 |
|       -4.4977847088 | 560.0 |
|       -4.0669415786 | 570.0 |
|       -3.6360984484 | 580.0 |
|       -3.2052553182 | 590.0 |
| -2.8369121880000003 | 600.0 |
|       -1.9752259276 | 620.0 |
| -1.6068827974000002 | 630.0 |
|       -1.2385396672 | 640.0 |
|        -0.870196537 | 650.0 |
| -0.6893534068000001 | 660.0 |
| -0.5085102765999999 | 670.0 |

